
const MAP_LANG_DICT = {
    'தமிழ்': 'Tamil',
    'English': 'English'
};

const MAP_ISO_DICT = {
    'Tamil':     'ta-IN',
    'English':   'en-IN'
}

const MAP_DOT_DICT = {
    'hindi':    '\\u094D',
    'marathi':  '\\u094D',
    'bengali':  '\\u09CD',
    'gujarati': '\\u0ACD',
    'punjabi':  '\\u0A4D',
    'assamese': '\\u09CD'
};

const MAP_INFO_DICT = {
    'English': {
        'App Title': 'Audio Books Collection',
        'Author': 'Author',
        'Narrator': 'Narrator',
        'Type': 'Type',
        'Book': 'Story',
        'About': 'About',
        'Info': 'Info',
        'Stats': 'Stats',
        'Search': 'Search',
        'Playlist': 'Playlist',
        'References': 'References',
        'Written': 'Written',
        'Read': 'Read',
        'Name': 'Name',
        'Wiki': 'Wikipedia',
        'Born': 'Born',
        'Died': 'Died',
        'English': 'English',
        'Tamil': 'Tamil',
        'Videos': 'Videos',
        'Authors': 'Authors',
        'Narrators': 'Narrators',
        'Types': 'Types',
        'Books': 'Stories',
        'Duration': 'Duration',
        'Views': 'Views',
        'Categories': 'Categories',
        'Menu': 'Menu',
        'Home': 'Home',
        'Fetch': 'Fetching data, Please wait...',
        'Updated': 'Updated',
        'Search Results': 'Search Results'
    },
    'Tamil': {
        'App Title': 'யூடியூப் இசை தொகுப்பு',
        'Author': 'ஆசிரியர்',
        'Narrator': 'வாசிப்பவர்',
        'Type': 'வகை',
        'Book': 'கதை',
        'About': 'பற்றி',
        'Info': 'தகவல்',
        'Stats': 'புள்ளிவிவரம்',
        'Search': 'தேடு',
        'Playlist': 'பிளேலிஸ்ட்',
        'References': 'குறிப்புகள்',
        'Written': 'எழுதப்பட்டது',
        'Read': 'படிக்க',
        'Name': 'பெயர்',
        'Wiki': 'விக்கிப்பீடியா',
        'Born': 'பிறப்பு',
        'Died': 'இறப்பு',
        'English': 'ஆங்கிலம்',
        'Tamil': 'தமிழ்',
        'Videos': 'காணொளிகள்',
        'Authors': 'ஆசிரியர்கள்',
        'Narrators': 'வாசிப்பவர்கள்',
        'Types': 'வகைகள்',
        'Books': 'கதைகள்',
        'Duration': 'காலம்',
        'Views': 'பார்வைகள்',
        'Categories': 'பகுப்புகள்',
        'Menu': 'பட்டியல்',
        'Home': 'முகப்பு',
        'Fetch': 'தரவைப் பெறுகிறோம், தயவுசெய்து காத்திருங்கள்',
        'Updated': 'புதுப்பிக்கப்பட்டது',
        'Search Results': 'தேடல் முடிவுகள்'
    }
};

const MAP_MONTH_DICT = {
    'Tamil': {
        'Jan': 'ஜனவரி',
        'Feb': 'பிப்ரவரி',
        'Mar': 'மார்ச்',
        'Apr': 'ஏப்ரல்',
        'May': 'மே',
        'Jun': 'ஜூன்',
        'Jul': 'ஜூலை',
        'Aug': 'ஆகஸ்ட்',
        'Sep': 'செப்டம்பர்',
        'Oct': 'அக்டோபர்',
        'Nov': 'நவம்பர்',
        'Dec': 'டிசம்பர்'
    },
    'Telugu': {
        'Jan': 'జనవరి',
        'Feb': 'ఫిబ్రవరి',
        'Mar': 'మార్చి',
        'Apr': 'ఏప్రిల్',
        'May': 'మే',
        'Jun': 'జూన్',
        'Jul': 'జూలై',
        'Aug': 'ఆగస్టు',
        'Sep': 'సెప్టెంబర్',
        'Oct': 'అక్టోబర్',
        'Nov': 'నవంబర్',
        'Dec': 'డిసెంబర్'
    },
    'Kannada': {
        'Jan': 'ಜನವರಿ',
        'Feb': 'ಫೆಬ್ರವರಿ',
        'Mar': 'ಮಾರ್ಚ್',
        'Apr': 'ಏಪ್ರಿಲ್',
        'May': 'ಮೇ',
        'Jun': 'ಜೂನ್',
        'Jul': 'ಜುಲೈ',
        'Aug': 'ಆಗಸ್ಟ್',
        'Sep': 'ಸೆಪ್ಟೆಂಬರ್',
        'Oct': 'ಅಕ್ಟೋಬರ್',
        'Nov': 'ನವೆಂಬರ್',
        'Dec': 'ಡಿಸೆಂಬರ್'
    },
    'Malayalam': {
        'Jan': 'ജനുവരി',
        'Feb': 'ഫെബ്രുവരി',
        'Mar': 'മാർച്ച്',
        'Apr': 'ഏപ്രിൽ',
        'May': 'മേയ്',
        'Jun': 'ജൂൺ',
        'Jul': 'ജൂലൈ',
        'Aug': 'ആഗസ്റ്റ്',
        'Sep': 'സെപ്തംബർ',
        'Oct': 'ഒക്ടോബർ',
        'Nov': 'നവംബർ',
        'Dec': 'ഡിസംബർ'
    },
    'Hindi': {
        'Jan': 'जनवरी',
        'Feb': 'फ़रवरी',
        'Mar': 'मार्च',
        'Apr': 'अप्रैल',
        'May': 'मई',
        'Jun': 'जून',
        'Jul': 'जुलाई',
        'Aug': 'अगस्त',
        'Sep': 'सितंबर',
        'Oct': 'अक्टूबर',
        'Nov': 'नवंबर',
        'Dec': 'दिसंबर'
    },
    'Marathi': {
        'Jan': 'जनवरी',
        'Feb': 'फ़रवरी',
        'Mar': 'मार्च',
        'Apr': 'अप्रैल',
        'May': 'मई',
        'Jun': 'जून',
        'Jul': 'जुलाई',
        'Aug': 'अगस्त',
        'Sep': 'सितंबर',
        'Oct': 'अक्टूबर',
        'Nov': 'नवंबर',
        'Dec': 'दिसंबर'
    },
    'Bengali': {
        'Jan': 'জানুয়ারী',
        'Feb': 'ফেব্রুয়ারী',
        'Mar': 'মার্চ',
        'Apr': 'এপ্রিল',
        'May': 'মে',
        'Jun': 'জুন',
        'Jul': 'জুলাই',
        'Aug': 'আগস্ট',
        'Sep': 'সেপ্টেম্বর',
        'Oct': 'অক্টোবর',
        'Nov': 'নভেম্বর',
        'Dec': 'ডিসেম্বর'
    },
    'Gujarati': {
        'Jan': 'જાન્યુઆરી',
        'Feb': 'ફેબ્રુઆરી',
        'Mar': 'মার্চ',
        'Apr': 'એપ્રિલ',
        'May': 'મે',
        'Jun': 'જૂન',
        'Jul': 'જુલાઈ',
        'Aug': 'ઓગસ્ટ',
        'Sep': 'સપ્ટેમ્બર',
        'Oct': 'ઓક્ટોબર',
        'Nov': 'નવેમ્બર',
        'Dec': 'ડિસેમ્બર'
    },
    'Punjabi': {
        'Jan': 'ਜਨਵਰੀ',
        'Feb': 'ਫਰਵਰੀ',
        'Mar': 'ਮਾਰਚ',
        'Apr': 'ਅਪ੍ਰੈਲ',
        'May': 'ਮਈ',
        'Jun': 'ਜੂਨ',
        'Jul': 'ਜੁਲਾਈ',
        'Aug': 'ਅਗਸਤ',
        'Sep': 'ਸਤੰਬਰ',
        'Oct': 'ਅਕਤੂਬਰ',
        'Nov': 'ਨਵੰਬਰ',
        'Dec': 'ਦਸੰਬਰ'
    },
    'Odia': {
        'Jan': 'ଜାନୁଆରୀ',
        'Feb': 'ଫେବୃଆରୀ',
        'Mar': 'ମାର୍ଚ୍ଚ',
        'Apr': 'ଏପ୍ରିଲ୍',
        'May': 'ମାସ',
        'Jun': 'ଜୁନ୍',
        'Jul': 'ଜୁଲାଇ',
        'Aug': 'ଅଗଷ୍ଟ',
        'Sep': 'ସେପ୍ଟେମ୍ବର',
        'Oct': 'ଅକ୍ଟୋବର',
        'Nov': 'ନଭେମ୍ବର',
        'Dec': 'ଡିସେମ୍ବର'
    },
    'Assamese': {
        'Jan': 'জানুৱাৰী',
        'Feb': 'ফেব্ৰুৱাৰী',
        'Mar': 'মাৰ্চ',
        'Apr': 'এপ্ৰিল',
        'May': 'মে',
        'Jun': 'জুন',
        'Jul': 'জুলাই',
        'Aug': 'আগষ্ট',
        'Sep': 'ছেপ্টেম্বৰ',
        'Oct': 'অক্টোবৰ',
        'Nov': 'নৱেম্বৰ',
        'Dec': 'ডিচেম্বৰ'
    }
};

let MAP_KEYBOARD_DICT = {"devanagari": {"base": "0x900", "vowel": ["अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ऌ", "ऍ", "ऎ", "ए", "ऐ", "ऑ", "ऒ", "ओ", "औ", "ॠ", "ॡ"], "glyph": ["्", "ा", "ि", "ी", "ु", "ू", "ृ", "ॢ", "ॅ", "ॆ", "े", "ै", "ॉ", "ॊ", "ो", "ौ", "ॄ", "ॣ", "ँ", "ं", "ः"], "consonant": ["क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "ऩ", "प", "फ", "ब", "भ", "म", "य", "र", "ऱ", "ल", "ळ", "ऴ", "व", "श", "ष", "स", "ह", "क़", "ख़", "ग़", "ज़", "ड़", "ढ़", "फ़", "य़"], "special": ["ऽ", "ॐ"], "middle": ["ँ", "ं", "ः"]}, "tamil": {"base": "0xb80", "vowel": ["அ", "ஆ", "இ", "ஈ", "உ", "ஊ", "எ", "ஏ", "ஐ", "ஒ", "ஓ", "ஔ"], "glyph": ["்", "ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ"], "consonant": ["க", "ங", "ச", "ஞ", "ட", "த", "ந", "ன", "ண", "ப", "ம", "ய", "ர", "ற", "ல", "ள", "ழ", "வ"], "special": ["ஃ", "ௐ", "ஸ்ரீ"], "middle": ["ஜ", "ஶ", "ஷ", "ஸ", "ஹ", "க்ஷ"]}, "telugu": {"base": "0xc00", "vowel": ["అ", "ఆ", "ఇ", "ఈ", "ఉ", "ఊ", "ఋ", "ఌ", "ఎ", "ఏ", "ఐ", "ఒ", "ఓ", "ఔ", "ౠ", "ౡ"], "glyph": ["్", "ా", "ి", "ీ", "ు", "ూ", "ృ", "ౢ", "ె", "ే", "ై", "ొ", "ో", "ౌ", "ౄ", "ౣ", "ఁ", "ం", "ః"], "consonant": ["క", "ఖ", "గ", "ఘ", "ఙ", "చ", "ఛ", "జ", "ఝ", "ఞ", "ట", "ఠ", "డ", "ఢ", "ణ", "త", "థ", "ద", "ధ", "న", "ప", "ఫ", "బ", "భ", "మ", "య", "ర", "ఱ", "ల", "ళ", "ఴ", "వ", "శ", "ష", "స", "హ"], "special": ["ఽ"], "middle": ["ఁ", "ం", "ః"]}, "kannada": {"base": "0xc80", "vowel": ["ಅ", "ಆ", "ಇ", "ಈ", "ಉ", "ಊ", "ಋ", "ಌ", "ಎ", "ಏ", "ಐ", "ಒ", "ಓ", "ಔ", "ೠ", "ೡ"], "glyph": ["್", "ಾ", "ಿ", "ೀ", "ು", "ೂ", "ೃ", "ೢ", "ೆ", "ೇ", "ೈ", "ೊ", "ೋ", "ೌ", "ೄ", "ೣ", "ಁ", "ಂ", "ಃ"], "consonant": ["ಕ", "ಖ", "ಗ", "ಘ", "ಙ", "ಚ", "ಛ", "ಜ", "ಝ", "ಞ", "ಟ", "ಠ", "ಡ", "ಢ", "ಣ", "ತ", "ಥ", "ದ", "ಧ", "ನ", "ಪ", "ಫ", "ಬ", "ಭ", "ಮ", "ಯ", "ರ", "ಲ", "ವ", "ಶ", "ಷ", "ಸ", "ಹ"], "special": ["ಽ"], "middle": ["ಁ", "ಂ", "ಃ"]}, "malayalam": {"base": "0xd00", "vowel": ["അ", "ആ", "ഇ", "ഈ", "ഉ", "ഊ", "ഋ", "ഌ", "എ", "ഏ", "ഐ", "ഒ", "ഓ", "ഔ", "ൠ", "ൡ"], "glyph": ["്", "ാ", "ി", "ീ", "ു", "ൂ", "ൃ", "ൢ", "െ", "േ", "ൈ", "ൊ", "ോ", "ൌ", "ൄ", "ൣ", "ം", "ഃ"], "consonant": ["ക", "ഖ", "ഗ", "ഘ", "ങ", "ച", "ഛ", "ജ", "ഝ", "ഞ", "ട", "ഠ", "ഡ", "ഢ", "ണ", "ത", "ഥ", "ദ", "ധ", "ന", "ഩ", "പ", "ഫ", "ബ", "ഭ", "മ", "യ", "ര", "റ", "ല", "ള", "ഴ", "വ", "ശ", "ഷ", "സ", "ഹ"], "special": ["ഽ"], "middle": ["ം", "ഃ"]}, "sanskrit": {"base": "0x900", "vowel": ["अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ऌ", "ऍ", "ए", "ऐ", "ऑ", "ओ", "औ", "ॠ", "ॡ"], "glyph": ["्", "ा", "ि", "ी", "ु", "ू", "ृ", "ॢ", "ॅ", "े", "ै", "ॉ", "ो", "ौ", "ॄ", "ॣ", "ँ", "ं", "ः"], "consonant": ["क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "क़", "ख़", "ग़", "ज़", "ड़", "ढ़", "फ़", "य़"], "special": ["ऽ", "ॐ"], "middle": ["ँ", "ं", "ः"]}, "hindi": {"base": "0x900", "vowel": ["अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ऌ", "ऍ", "ए", "ऐ", "ऑ", "ओ", "औ", "ॠ", "ॡ"], "glyph": ["्", "ा", "ि", "ी", "ु", "ू", "ृ", "ॢ", "ॅ", "े", "ै", "ॉ", "ो", "ौ", "ॄ", "ॣ", "ँ", "ं", "ः"], "consonant": ["क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "क़", "ख़", "ग़", "ज़", "ड़", "ढ़", "फ़", "य़"], "special": ["ऽ", "ॐ"], "middle": ["ँ", "ं", "ः"]}, "marathi": {"base": "0x900", "vowel": ["अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ऌ", "ऍ", "ए", "ऐ", "ऑ", "ओ", "औ", "ॠ", "ॡ"], "glyph": ["्", "ा", "ि", "ी", "ु", "ू", "ृ", "ॢ", "ॅ", "े", "ै", "ॉ", "ो", "ौ", "ॄ", "ॣ", "ँ", "ं", "ः"], "consonant": ["क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ", "म", "य", "र", "ल", "ळ", "व", "श", "ष", "स", "ह", "क़", "ख़", "ग़", "ज़", "ड़", "ढ़", "फ़", "य़"], "special": ["ऽ"], "middle": ["ँ", "ं", "ः"]}, "bengali": {"base": "0x980", "vowel": ["অ", "আ", "ই", "ঈ", "উ", "ঊ", "ঋ", "ঌ", "এ", "ঐ", "ও", "ঔ", "ৠ", "ৡ"], "glyph": ["্", "া", "ি", "ী", "ু", "ূ", "ৃ", "ৢ", "ে", "ৈ", "ো", "ৌ", "ৄ", "ৣ", "ঁ", "ং", "ঃ"], "consonant": ["ক", "খ", "গ", "ঘ", "ঙ", "চ", "ছ", "জ", "ঝ", "ঞ", "ট", "ঠ", "ড", "ঢ", "ণ", "ত", "থ", "দ", "ধ", "ন", "প", "ফ", "ব", "ভ", "ম", "য", "র", "ল", "শ", "ষ", "স", "হ"], "special": ["ঽ"], "middle": ["ঁ", "ং", "ঃ"]}, "punjabi": {"base": "0xa00", "vowel": ["ਅ", "ਆ", "ਇ", "ਈ", "ਉ", "ਊ", "ਏ", "ਐ", "ਓ", "ਔ"], "glyph": ["੍", "ਾ", "ਿ", "ੀ", "ੁ", "ੂ", "ੇ", "ੈ", "ੋ", "ੌ", "ਁ", "ਂ", "ਃ"], "consonant": ["ਕ", "ਖ", "ਗ", "ਘ", "ਙ", "ਚ", "ਛ", "ਜ", "ਝ", "ਞ", "ਟ", "ਠ", "ਡ", "ਢ", "ਣ", "ਤ", "ਥ", "ਦ", "ਧ", "ਨ", "ਪ", "ਫ", "ਬ", "ਭ", "ਮ", "ਯ", "ਰ", "ਲ", "ਲ਼", "ਵ", "ਸ਼", "ਸ", "ਹ"], "special": [], "middle": ["ਁ", "ਂ", "ਃ"]}, "gujarati": {"base": "0xa80", "vowel": ["અ", "આ", "ઇ", "ઈ", "ઉ", "ઊ", "ઋ", "ઌ", "એ", "ઐ", "ઓ", "ઔ", "ૠ", "ૡ"], "glyph": ["્", "ા", "િ", "ી", "ુ", "ૂ", "ૃ", "ૢ", "ે", "ૈ", "ો", "ૌ", "ૄ", "ૣ", "ઁ", "ં", "ઃ"], "consonant": ["ક", "ખ", "ગ", "ઘ", "ઙ", "ચ", "છ", "જ", "ઝ", "ઞ", "ટ", "ઠ", "ડ", "ઢ", "ણ", "ત", "થ", "દ", "ધ", "ન", "પ", "ફ", "બ", "ભ", "મ", "ય", "ર", "લ", "વ", "શ", "ષ", "સ", "હ"], "special": ["ઽ"], "middle": ["ઁ", "ં", "ઃ"]}, "odia": {"base": "0xb00", "vowel": ["ଅ", "ଆ", "ଇ", "ଈ", "ଉ", "ଊ", "ଋ", "ଌ", "ଏ", "ଐ", "ଓ", "ଔ", "ୠ", "ୡ"], "glyph": ["୍", "ା", "ି", "ୀ", "ୁ", "ୂ", "ୃ", "ୢ", "େ", "ୈ", "ୋ", "ୌ", "ୄ", "ୣ", "ଁ", "ଂ", "ଃ"], "consonant": ["କ", "ଖ", "ଗ", "ଘ", "ଙ", "ଚ", "ଛ", "ଜ", "ଝ", "ଞ", "ଟ", "ଠ", "ଡ", "ଢ", "ଣ", "ତ", "ଥ", "ଦ", "ଧ", "ନ", "ପ", "ଫ", "ବ", "ଭ", "ମ", "ଯ", "ର", "ଲ", "ଵ", "ଶ", "ଷ", "ସ", "ହ"], "special": ["ଽ"], "middle": ["ଁ", "ଂ", "ଃ"]}, "assamese": {"base": "0x980", "vowel": ["অ", "আ", "ই", "ঈ", "উ", "ঊ", "ঋ", "ঌ", "এ", "ঐ", "ও", "ঔ", "ৠ", "ৡ"], "glyph": ["্", "া", "ি", "ী", "ু", "ূ", "ৃ", "ৢ", "ে", "ৈ", "ো", "ৌ", "ৄ", "ৣ", "ঁ", "ং", "ঃ"], "consonant": ["ক", "খ", "গ", "ঘ", "ঙ", "চ", "ছ", "জ", "ঝ", "ঞ", "ট", "ঠ", "ড", "ঢ", "ণ", "ত", "থ", "দ", "ধ", "ন", "প", "ফ", "ব", "ভ", "ম", "য", "র", "ল", "শ", "ষ", "স", "হ"], "special": ["ঽ"], "middle": ["ঁ", "ং", "ঃ"]}, "english": {"base": "0", "vowel": ["a", "A", "i", "I", "u", "U", ".R", "l.R", "aE", "e", "E", "ai", "aO", "o", "O", "au", ".R.R", "l.R.R"], "glyph": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "consonant": ["k", "kh", "g", "gh", "G", "c", "ch", "j", "jh", "J", "T", "Th", "D", "Dh", "N", "t", "th", "d", "dh", "n", ".n", "p", "ph", "b", "bh", "m", "y", "r", "R", "l", "L", "zh", "v", "S", "sh", "s", "h", "q", "qh", "g2", "z", "d3", "d3h", "f", "Y"], "special": [], "middle": []}};

const SUPERSCRIPT_CODES = [ 0x00B2, 0x00B3, 0x2074 ];

const CATEGORY_DICT = { 'categories' : [ { 'C' : 'author',   'I' : 'person-fill', 'N' : 'Author'   },
                                         { 'C' : 'narrator', 'I' : 'reading',     'N' : 'Narrator' },
                                         { 'C' : 'type',     'I' : 'tag',         'N' : 'Type'     },
                                         { 'C' : 'book',     'I' : 'solid-book',  'N' : 'Book'     },
                                         { 'C' : 'about',    'I' : 'info-circle', 'N' : 'About'    },
                                       ]
                      };

